tutorials/cfdemSolverRhoPimpleChem/SingleParticleCases/ISO4695/CFD/constant/combustionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      combustionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// OF5 -> OF6: noCombustion<> -> none (template parameters are no longer required)
//combustionModel   noCombustion<rhoThermoCombustion>; //PaSR<rhoChemistryCombustion>;  //PaSR<psiChemistryCombustion>;
combustionModel  none; // OF6

active  false; //true;

//noCombustionCoeffs
noneCoeffs
{
}


PaSRCoeffs
{
    Cmix                1.0;
    turbulentReaction   off;
}


// ************************************************************************* //
