tutorials/cfdemSolverRhoPimpleChem/SingleParticleCases/ISO4695/CFD/constant/couplingProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/


FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          couplingProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//===========================================================================//
// sub-models & settings

modelType "A"; // A or B

couplingInterval 50;

voidFractionModel divided;//centre;//

locateModel engine; //turboEngineM2M;//

meshMotionModel noMeshMotion;

regionModel allRegion;

IOModel basicIO;

probeModel off;

dataExchangeModel twoWayMPI;

averagingModel dilute; //dense;//

clockModel off;//standardClock;//

smoothingModel off;// localPSizeDiffSmoothing;// constDiffSmoothing; //

forceModels
(
    GidaspowDrag
    gradPForce
    viscForce
);

energyModels
(
    heatTransferGunn
    reactionHeat
);

thermCondModel SyamlalThermCond;

chemistryModels
(
    species
    diffusionCoefficients
    massTransferCoeff
    // off
);

momCoupleModels
(
    implicitCouple
);

turbulenceModelType "turbulenceProperties";//"LESProperties";//

//===========================================================================//
// sub-model properties
reactionHeatProps
{
    reactionHeatName    "reactionHeat";
    verbose             false;
}

heatTransferGunnProps
{
    partTempName "Temp";
    partHeatFluxName "convectiveHeatFlux";
    calcPartTempField true;
    partRefTemp 1223.15;
    implicit true;
    verbose false;
    interpolation false;
}

speciesProps
{
    ChemistryFile   "$FOAM_CASE/constant/foam.inp";
    Nevery          1;
    verbose         false;
    interpolation   false;
}

diffusionCoefficientsProps
{
    verbose             false;
    interpolation       false;
    ChemistryFile       "$FOAM_CASE/constant/foam.inp";
    diffusantGasNames   (    CO
                        );
}

massTransferCoeffProps
{
    verbose         false;
    interpolation   false;
}

reactantPerParticleProps
{
}

SyamlalThermCondProps
{
    voidfractionFieldName   "voidfraction";
    rhoFieldName            "rho";
}

LaEuScalarTempProps
{
    velFieldName "U";
    tempFieldName "T";
    voidfractionFieldName "voidfraction";
    partTempName "Temp";
    partHeatFluxName "convectiveHeatFlux";
    lambda 0.0256;
    Cp 1007;
}

localPSizeDiffSmoothingProps
{
    lowerLimit 0.1;
    upperLimit 1e10;
    dSmoothingLength 1.5e-3;
    Csmoothing 1.0; 
}

constDiffSmoothingProps
{
    lowerLimit 0.1;
    upperLimit 1e10;
    smoothingLength 1.5e-3;
}

implicitCoupleProps
{
    velFieldName "U";
    granVelFieldName "Us";
    voidfractionFieldName "voidfraction";
}

ArchimedesProps
{
    gravityFieldName "g";
}

gradPForceProps
{
    pFieldName "p";
    voidfractionFieldName "voidfraction";
    velocityFieldName "U";
    interpolation true;
}

viscForceProps
{
    velocityFieldName "U";
    interpolation true;
}

volWeightedAverageProps
{
    scalarFieldNames
    (
        voidfraction
    );
    vectorFieldNames
    (
    );
    upperThreshold 0.999;
    lowerThreshold 0;
    verbose true;
}

totalMomentumExchangeProps
{
    implicitMomExFieldName "Ksl";
    explicitMomExFieldName "none";
    fluidVelFieldName "U";
    granVelFieldName "Us";
}

GidaspowDragProps
{
    verbose true;
    velFieldName "U";
    granVelFieldName "Us";
    voidfractionFieldName "voidfraction";
    interpolation true;
    phi 1;
}

BeetstraDragProps
{
    velFieldName "U";
    granVelFieldName "Us";
    gravityFieldName "g";
    voidfractionFieldName "voidfraction";
    interpolation false;
    useFilteredDragModel ;
    useParcelSizeDependentFilteredDrag;
    rhoP    4630.;
    dPrim   0.00022;
    rho     1.58;
    nuf     1.126e-05;
    g       9.81;
    k       0.05;
    aLimit  0.0;
    verbose false;
}

DEMbasedDragProps
{
    velFieldName "U";
    voidfractionFieldName "voidfraction";
}

DiFeliceDragProps
{
    velFieldName "U";
    voidfractionFieldName "voidfraction";
    granVelFieldName "Us";
    interpolation false;
}

KochHillDragProps
{
    verbose true;
    velFieldName "U";
    voidfractionFieldName "voidfraction";
    interpolation false;
    implForceDEM true;
}

RongDragProps
{
    verbose true;
    velFieldName "U";
    voidfractionFieldName "voidfraction";
    interpolation false;
    implForceDEM true;
    implForceDEMaccumulated true;
    granVelFieldName "Us";
}

virtualMassForceProps
{
    velFieldName "U";
}

particleCellVolumeProps
{
    upperThreshold 0.999;
    lowerThreshold 0.;
    verbose true;
}

fieldStoreProps
{
    scalarFieldNames
    (
    );

    vectorFieldNames
    (
        "U"
    );
}

oneWayVTKProps
{
    couplingFilename "vtk_out%4.4d.vtk";
    maxNumberOfParticles 30000;
}

twoWayFilesProps
{
    maxNumberOfParticles 10100;
}

centreProps
{
    alphaMin 0.1;
}

engineProps
{
    treeSearch true;
}

turboEngineProps
{
    treeSearch true;
}

turboEngineM2MProps
{
    turboEngineProps
    {
        treeSearch true;
    }
}

dividedProps
{
    alphaMin 0.01;
    scaleUpVol 1.0;
}

twoWayMPIProps
{
    liggghtsPath "../DEM/in.liggghts_run";
}

twoWayM2MProps
{
    maxNumberOfParticles 10100;
    liggghtsPath "../DEM/in.liggghts_run";
}
// ************************************************************************* //
